In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
infile = r'C:\Users\Bhavyashree\Desktop\ML\Decision_Tree\salaries.csv'

In [3]:
df1 = pd.read_csv(infile)
df1.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
from sklearn.preprocessing import LabelEncoder

In [13]:
inputs = df1[['company','job','degree']]
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [16]:
target_df = df1[['salary_more_then_100k']]
target_df

    salary_more_then_100k
0                       0
1                       0
2                       1
3                       1
4                       0
5                       1
6                       0
7                       0
8                       0
9                       1
10                      1
11                      1
12                      1
13                      1
14                      1
15                      1

In [17]:
comp_le = LabelEncoder()
job_le = LabelEncoder()
degree_le = LabelEncoder()

In [18]:
inputs['company'] = comp_le.fit_transform(inputs['company'])

<ipython-input-18-167e95061c01>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['company'] = comp_le.fit_transform(inputs['company'])

In [19]:
inputs['job'] = job_le.fit_transform(inputs['job'])
inputs['degree'] = degree_le.fit_transform(inputs['degree'])

<ipython-input-19-bd3ba29e838f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['job'] = job_le.fit_transform(inputs['job'])
<ipython-input-19-bd3ba29e838f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inputs['degree'] = degree_le.fit_transform(inputs['degree'])

In [20]:
inputs.head()

   company  job  degree
0        2    2       0
1        2    2       1
2        2    0       0
3        2    0       1
4        2    1       0

In [25]:
inputs

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [22]:
target_df.head()

   salary_more_then_100k
0                      0
1                      0
2                      1
3                      1
4                      0

In [23]:
from sklearn.tree import DecisionTreeClassifier
dtree = DecisionTreeClassifier()

In [24]:
train_model = dtree.fit(inputs, target_df)

In [27]:
train_model.predict([[2,0,0]])

array([1], dtype=int64)

In [29]:
train_model.score(inputs,target_df)

1.0

In [31]:
from sklearn.model_selection import train_test_split

In [35]:
x_train, x_test, y_train, y_test = train_test_split(inputs, target_df, train_size = 0.8)

In [36]:
x_train

    company  job  degree
13        1    0       1
3         2    0       1
1         2    2       1
10        1    2       0
2         2    0       0
4         2    1       0
8         0    0       0
5         2    1       1
9         0    0       1
15        1    1       1
14        1    1       0
6         0    2       1

In [37]:
dtree.predict(x_test)

array([1, 1, 0, 0], dtype=int64)

In [38]:
y_test

    salary_more_then_100k
11                      1
12                      1
7                       0
0                       0

In [39]:
dtree.predict(y_test)

ValueError: X has 1 features, but DecisionTreeClassifier is expecting 3 features as input.

In [40]:
dtree.score(x_test,y_test)

1.0

In [ ]:
# Exercise -
#In this file using following columns build a model to predict if person would survive or not,
#Pclass
#Sex
#Age
#Fare
#Calculate score of your model

In [41]:
infile2 = r'C:\Users\Bhavyashree\Desktop\ML\Decision_Tree\Titanic.csv'
Tnc_df = pd.read_csv(infile2)

In [43]:
Tnc_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
in_df = Tnc_df[['Pclass','Sex','Age','Fare']]
in_df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [47]:
sex_le = LabelEncoder()
in_df['Sex'] = sex_le.fit_transform(in_df['Sex'])

<ipython-input-47-d32cb96dde80>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  in_df['Sex'] = sex_le.fit_transform(in_df['Sex'])

In [48]:
in_df.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [49]:
in_df

     Pclass  Sex   Age     Fare
0         3    1  22.0   7.2500
1         1    0  38.0  71.2833
2         3    0  26.0   7.9250
3         1    0  35.0  53.1000
4         3    1  35.0   8.0500
..      ...  ...   ...      ...
886       2    1  27.0  13.0000
887       1    0  19.0  30.0000
888       3    0   NaN  23.4500
889       1    1  26.0  30.0000
890       3    1  32.0   7.7500

[891 rows x 4 columns]

In [50]:
in_df.interpolate(inplace=True)
in_df

<ipython-input-50-7fd397604300>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  in_df.interpolate(inplace=True)

     Pclass  Sex   Age     Fare
0         3    1  22.0   7.2500
1         1    0  38.0  71.2833
2         3    0  26.0   7.9250
3         1    0  35.0  53.1000
4         3    1  35.0   8.0500
..      ...  ...   ...      ...
886       2    1  27.0  13.0000
887       1    0  19.0  30.0000
888       3    0  22.5  23.4500
889       1    1  26.0  30.0000
890       3    1  32.0   7.7500

[891 rows x 4 columns]

In [51]:
tgt_df = Tnc_df['Survived']

In [52]:
tgt_df

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [53]:
from sklearn.tree import DecisionTreeClassifier
dtree_model = DecisionTreeClassifier()

In [54]:
x_train, x_test, y_train, y_test = train_test_split(in_df, tgt_df, test_size = 0.2)

In [56]:
dtree_model.fit(x_train,y_train)

DecisionTreeClassifier()

In [57]:
dtree_model.predict(x_test)

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0,
       1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0,
       1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0,
       0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0,
       1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1], dtype=int64)

In [60]:
a = []
for i in y_test:
    a.append(i)
print(a)

[0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1]

In [61]:
dtree_model.score(x_test, y_test)

0.7988826815642458